#+TITLE: Kind Audit Logs
#+AUTHOR: Hippie Hacker
#+EMAIL: hh.coop
#+CREATOR: ii.coop
#+DATE: 27 April, 2019
#+STARTUP: showeverything
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/

** async
#+BEGIN_SRC shell :async
echo hello
sleep 5
echo hello
sleep 5
echo hello
sleep 5
echo hello
sleep 5
echo hello
sleep 5
echo hello
sleep 5
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
hello
hello
hello
hello
hello
hello
#+END_EXAMPLE

* Failures on 1-11, 1-12, and 1-13

https://github.com/kubernetes-sigs/kind/pull/457#issuecomment-487276162
https://storage.googleapis.com/kubernetes-jenkins/pr-logs/pull/sigs.k8s.io_kind/457/pull-kind-conformance-parallel-1-13/1122010080514936835/build-log.txt

#+BEGIN_EXAMPLE
W0427 05:37:21.316] Error: failed to create cluster: failed to generate kubeadm config content:
failed to find an object with kubeadm.k8s.io_v1beta1_ClusterConfiguration|config to apply the patch
...
W0427 05:37:38.089] subprocess.CalledProcessError:
Command '('bash', '-c', 'cd ./../../k8s.io/kubernetes && ./../../sigs.k8s.io/kind/hack/ci/e2e.sh')' returned non-zero exit status 1
#+END_EXAMPLE


https://github.com/kubernetes-sigs/kind/pull/457#issuecomment-487257154

Looks like it's only affecting versions prior to 1.14

- pull-kind-conformance-parallel-1-11
- pull-kind-conformance-parallel-1-12
- pull-kind-conformance-parallel-1-13

Jobs are defined here:

https://github.com/kubernetes/test-infra/blob/master/config/jobs/kubernetes-sigs/kind/kind-presubmits.yaml

I'm noting that the we pass **--repo=k8s.io/kubernetes=release-X** to kubekins-e2e for each of them.

You can reproduce by checking out the branches that fail.

```
cd ~/go/src/k8s.io/kubernetes
git checkout release-1.14
rm -rf _output _artifacts
./../../sigs.k8s.io/kind/hack/ci/e2e.sh
```

I suspect it's due to the changes in kubeadm.ics.io_v1{beta,alpha}{1,2} ClusterConfiguration.

What should we do to dectect and change our ClusterConfiguration to match?

[[file:~/go/src/k8s.io/test-infra/config/jobs/kubernetes-sigs/kind/kind-presubmits.yaml::-%20name:%20pull-kind-conformance-parallel-1-13]]

I updated a PR to remove 1-11 am looking at a way to test more quickly.
Since we need to test/build several versions of k8s, we'll need get the right versions of go.

https://github.com/kubernetes/test-infra/blob/master/prow/cmd/phaino/README.md

To have different logic, we need to know the version of kubeadm we are using.
#+BEGIN_SRC shell
kubectl version --client=true 2>&1 | perl -pe 's/(^.*Minor:")([0-9]+)(.*$)/\2/'
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
13
#+END_EXAMPLE
